Repository: tiptoppaymobile/TipTopPay-SDK-iOS
Catalog: sdk/Resources/*.lproj/Localizable.strings
Languages: es, kk

# ttpsdk_error_word
source: Error
kk: Ошибка

# ttpsdk_error_no_data
source: There is no connection to the server
kk: Отсутствует соединение с сервером

# ttpsdk_error_creating_crypto
source: Error when creating a cryptographic package
kk: Ошибка при создании крипто-пакета

# ttpsdk_error_information
source: Information
kk: Информация

# ttpsdk_error_check_internet
source: Check your Internet connection
kk: Проверьте подключение к интернету

# ttpsdk_error_outdated
source: Data may be outdated
kk: Данные могли устареть

# ttpsdk_error_сorrect_data
source: Check the correctness of the data
kk: Проверьте корректность данных

# ttp_update_loader
source: Update payment methods
es: Cargando
kk: Загружаем способы оплаты

# ttpsdk_text_options_title
source: Choose a payment method
es: Elige un método de pago
kk: Выберите способ оплаты

# ttpsdk_text_options_card
source: Debit or credit card
es: Pago con tarjeta de débito o crédito
kk: Банковская карта

# ttpsdk_text_options_save_card
source: Save card
es: Guardar datos de la tarjeta
kk: Сохранить карту

# ttpsdk_text_options_email_checkbox
source: Send payment confirmation by e-mail
es: Enviar la confirmación de pago por correo electrónico
kk: Отправить квитанцию на E-mail

# ttpsdk_text_options_email_error
source: Incorrect E-mail
es: Correo electrónico incorrecto
kk: Некорректный E-mail

# ttpsdk_text_options_email_title_2
source: E-mail for the receipt
es: Correo electrónico para el recibo
kk: E-mail для квитанции

# ttpsdk_text_options_card_be_saved
source: Your сard information will be saved for this subscription
es: La información de la tarjeta se guardará para esta suscripción
kk: При оплате данные вашей карты сохранятся

# ttpsdk_text_options_save_card_popup_1
source: Safely store your card information for future purchases, so you don’t have to enter it again.
es: Guardar los datos de forma segura. No es necesario volver a ingresar para compras posteriores.
kk: Нажимая на чек-бокс, вы соглашаетесь с тем, что данные вашей карты сохранятся. Это означает, что при повторной оплате вам не надо будет вводить платежные реквизиты заново.

# ttpsdk_text_options_save_card_popup_2
source: At the same time, we will not be able to carry out any transactions on your card without your consent.
es: Sin embargo, no podremos realizar ninguna transacción en su tarjeta sin su consentimiento.
kk: При этом мы не сможем проводить никакие операции по вашей карте без вашего согласия.

# ttpsdk_text_card_title
source: Pay by card
es: Pagar con tarjeta
kk: Оплата картой

# ttpsdk_text_card_hint_number
source: Card number
es: Número de Tarjeta
kk: Номер карты

# ttpsdk_text_card_hint_number_incorrect
source: Incorrect card number
es: Número de tarjeta incorrecto
kk: Некорректный номер карты

# ttpsdk_text_card_hint_exp
source: MM / YY
es: Mes / Año
kk: ММ / ГГ

# ttpsdk_text_card_hint_exp_error
source: Date error
es: Error en la fecha
kk: Ошибка в дате

# ttpsdk_text_card_hint_cvv_error
source: CVV error
es: Error en CVV
kk: Ошибка в CVV

# ttpsdk_text_card_pay_button
source: Pay
kk: Оплатить

# ttpsdk_text_process_title
source: Payment is being processed
es: Procesando el pago
kk: Оплата в процессе

# ttpsdk_text_process_title_success
source: Payment completed
es: Pago realizado
kk: Оплата прошла успешно

# ttpsdk_text_process_button_success
source: Return to the store
es: Volver a la tienda
kk: Отлично!

# ttpsdk_text_process_title_error
source: The operation was rejected
kk: Операция отклонена

# ttpsdk_text_process_button_error
source: Try again
es: Vuelve a intentar
kk: Повторить попытку

# ttpsdk_error_connection
source: Connection lost
es: Error de conexión
kk: Отсутствует соединение с сервером

# ttpsdk_error_connection_extra
source: Please, check your Internet connection
es: Por favor, verifica tu conexión a internet
kk: Проверьте Ваше подключение к Интернету

# ttpsdk_error_3001
source: Please, try again
es: Por favor, vuelve a intentarlo más
kk: Неверный номер заказа

# ttpsdk_error_3002
source: Please, try again
es: Por favor, vuelve a intentarlo más
kk: Некорректный идентификатор плательщика

# ttpsdk_error_3003
source: Please, try again
es: Por favor, vuelve a intentarlo más
kk: Неверная сумма

# ttpsdk_error_3004
source: Please, try again
es: Por favor, vuelve a intentarlo más
kk: Платеж просрочен

# ttpsdk_error_3005
source: Please, try again
es: Por favor, vuelve a intentarlo más
kk: Платеж не может быть принят

# ttpsdk_error_3006
source: Please, try again
es: Por favor, vuelve a intentarlo más
kk: Сервис недоступен

# ttpsdk_error_3007
source: Please, try again
es: Por favor, vuelve a intentarlo más
kk: Ошибка соединения

# ttpsdk_error_3008
source: Please, try again
es: Por favor, vuelve a intentarlo más
kk: Платеж не может быть принят

# ttpsdk_error_5001
source: Please, try another card or payment method
es: Por favor, intenta con otra tarjeta o otro método de pago
kk: Отказ эмитента проводить онлайн операцию

# ttpsdk_error_5005
source: Please, try again
es: Por favor, vuelve a intentarlo más
kk: Операция отклонена эмитентом

# ttpsdk_error_5006
source: Make sure the card details you entered are correct or try with another card.
es: Asegúrate que los datos introducidos de la tarjeta son correctos o prueba con otra tarjeta
kk: Отказ сети проводить операцию или неправильный CVV код

# ttpsdk_error_5012
source: The card is not for online payments
es: La tarjeta introducida no está habilitada para pagos en línea
kk: Карта не предназначена для онлайн платежей

# ttpsdk_error_5013
source: Incorrect payment amount
es: El importe de la transacción es incorrecto
kk: Слишком маленькая или слишком большая сумма операции

# ttpsdk_error_5030
source: Please, try again
es: Por favor, vuelve a intentarlo más
kk: Ошибка на стороне эквайера

# ttpsdk_error_5031
source: Please, try again
es: Por favor, vuelve a intentarlo más
kk: Неизвестный эмитент карты

# ttpsdk_error_5034
source: Please, try another card or payment method
es: Por favor, intenta con otra tarjeta o otro método de pago
kk: Отказ эмитента

# ttpsdk_error_5041
source: Please, try another card or payment method
es: Por favor, intenta con otra tarjeta o otro método de pago
kk: Карта потеряна

# ttpsdk_error_5043
source: Please, try another card or payment method
es: Por favor, intenta con otra tarjeta o otro método de pago
kk: Карта украдена

# ttpsdk_error_5051
source: Insufficient funds on the card
es: Fondos insuficientes en la tarjeta
kk: Недостаточно средств на карте

# ttpsdk_error_5054
source: Card expired or invalid expiration date
es: La tarjeta ha expirado o la fecha de expiración es incorrecta
kk: Карта просрочена или неверно указан срок действия

# ttpsdk_error_5057
source: Please, try again
es: Por favor, vuelve a intentarlo más
kk: Ограничение на карте

# ttpsdk_error_5061
source: Card limit exceeded. Please, increase the limit or try another card
es: Límite de tarjeta excedido. Por favor aumente el límite o prueba con otra tarjeta.
kk: Не удалось выполнить оплату: превышен лимит по карте

# ttpsdk_error_5065
source: Exceeded transaction limit on the card. Please, increase the limit or try another card
es: Límite por transacción excedido. Por favor aumente el límite o prueba con otra tarjeta
kk: Превышен лимит операций по карте

# ttpsdk_error_5082
source: Incorrect CVV code
es: El código CVV es incorrecto
kk: Неверный CVV код

# ttpsdk_error_5091
source: Please, try again
es: Por favor, vuelve a intentarlo más
kk: Эмитент недоступен

# ttpsdk_error_5092
source: Please, try again
es: Por favor, vuelve a intentarlo más
kk: Эмитент недоступен

# ttpsdk_error_5096
source: Please, try again
es: Por favor, vuelve a intentarlo más
kk: Ошибка банка-эквайера или сети

# ttpsdk_error_5204
source: Please, try again
es: Por favor, vuelve a intentarlo más
kk: Операция не может быть обработана

# ttpsdk_error_5206
source: 3-D Secure authorization failed
es: La autorización 3-D secure fue fallida
kk: 3-D Secure авторизация не пройдена

# ttpsdk_error_5207
source: 3-D Secure authorization is not available. Please, try again
es: La autorización 3-D secure no está disponible. Por favor, vuelve a intentarlo más
kk: 3-D Secure авторизация недоступна

# ttpsdk_error_5300
source: Please, try again
es: Por favor, vuelve a intentarlo más
kk: Лимиты эквайера на проведение операций

# ttpsdk_error_3001_extra
source: If the error persists, please contact the page administrator
es: Si el error continúa, por favor ponte en contacto con el administrador de la página
kk: Платеж будет отклонен

# ttpsdk_error_3002_extra
source: If the error persists, please contact the page administrator
es: Si el error continúa, por favor ponte en contacto con el administrador de la página
kk: Платеж будет отклонен

# ttpsdk_error_3003_extra
source: If the error persists, please contact the page administrator
es: Si el error continúa, por favor ponte en contacto con el administrador de la página
kk: Обратитесь в поддержку сайта

# ttpsdk_error_3004_extra
source: If the error persists, please contact the page administrator
es: Si el error continúa, por favor ponte en contacto con el administrador de la página
kk: Обратитесь в поддержку сайта

# ttpsdk_error_3005_extra
source: If the error persists, please contact the page administrator
es: Si el error continúa, por favor ponte en contacto con el administrador de la página
kk: Платеж будет отклонен

# ttpsdk_error_3006_extra
source: If the error persists, please contact the page administrator
es: Si el error continúa, por favor ponte en contacto con el administrador de la página
kk: Платеж будет отклонен. Попробуйте позже

# ttpsdk_error_3007_extra
source: If the error persists, please contact the page administrator
es: Si el error continúa, por favor ponte en contacto con el administrador de la página
kk: Платеж будет отклонен. Попробуйте позже

# ttpsdk_error_3008_extra
source: If the error persists, please contact the page administrator
es: Si el error continúa, por favor ponte en contacto con el administrador de la página
kk: Платеж будет отклонен

# ttpsdk_error_5005_extra
source: If the error continues, please try with another card or another payment method
es: Si el error continúa, por favor intenta con otra tarjeta o otro método de pago
kk: Свяжитесь с вашим банком или воспользуйтесь другой картой

# ttpsdk_error_5012_extra
source: Please activate electronic payments in your bank app or try with another card or payment method.
es: Por favor, active los pagos electrónicos en su aplicación bancaria o intente con otra tarjeta o método de pago
kk: Воспользуйтесь другой картой или свяжитесь с банком, выпустившим карту

# ttpsdk_error_5013_extra
source: Check the amount
es: Asegúrate que el importe es correcto e inténtalo de nuevo
kk: Проверьте корректность суммы

# ttpsdk_error_5030_extra
source: If the error continues, please try with another card or another payment method
es: Si el error continúa, por favor intenta con otra tarjeta o otro método de pago
kk: Повторите попытку позже

# ttpsdk_error_5031_extra
source: If the error continues, please try with another card or another payment method
es: Si el error continúa, por favor intenta con otra tarjeta o otro método de pago
kk: Воспользуйтесь другой картой

# ttpsdk_error_5054_extra
source: Make sure the card details you entered are correct or try with another card
es: Asegúrate que los datos introducidos de la tarjeta son correctos o prueba con otra tarjeta
kk: Проверьте правильность введенных данных карты или воспользуйтесь другой картой

# ttpsdk_error_5057_extra
source: If the error continues, please try with another card or another payment method
es: Si el error continúa, por favor intenta con otra tarjeta o otro método de pago
kk: Свяжитесь с вашим банком или воспользуйтесь другой картой

# ttpsdk_error_5082_extra
source: Check the correctness of the entered card data or use another card
kk: Проверьте правильность введенных данных карты или воспользуйтесь другой картой

# ttpsdk_error_5091_extra
source: If the error continues, please try with another card or another payment method
es: Si el error continúa, por favor intenta con otra tarjeta o otro método de pago
kk: Повторите попытку позже или воспользуйтесь другой картой

# ttpsdk_error_5092_extra
source: If the error continues, please try with another card or another payment method
es: Si el error continúa, por favor intenta con otra tarjeta o otro método de pago
kk: Повторите попытку позже или воспользуйтесь другой картой

# ttpsdk_error_5096_extra
source: Please, try again
es: Si el error continúa, por favor intenta con otra tarjeta o otro método de pago
kk: Повторите попытку позже

# ttpsdk_error_5204_extra
source: If the error persists, please try another card or another payment method
es: Si el error continúa, por favor intenta con otra tarjeta o otro método de pago
kk: Свяжитесь с вашим банком или воспользуйтесь другой картой

# ttpsdk_error_5206_extra
source: Please, try again
es: Por favor, vuelve a intentarlo más
kk: Свяжитесь с вашим банком или воспользуйтесь другой картой

# ttpsdk_error_5207_extra
source: If the error continues, please try with another card or another payment method
es: Si el error continúa, por favor intenta con otra tarjeta o otro método de pago
kk: Свяжитесь с вашим банком или воспользуйтесь другой картой

# ttpsdk_error_5300_extra
source: If the error persists, please contact the page administrator
es: Si el error continúa, por favor ponte en contacto con el administrador de la página
kk: Свяжитесь с вашим банком или воспользуйтесь другой картой

# ttpsdk_error_1
source: The operation cannot be processed
kk: Операция не может быть обработана

# ttpsdk_error_2
source: Contact your bank or use another card
kk: Свяжитесь с вашим банком или воспользуйтесь другой картой

# ttp_sdk_three_ds_label
source: You will be redirected to your bank's 3DS confirmation page. Please keep your phone nearby
es: Será redirigido a la página de confirmación 3DS de su banco. Favor de tener su celular a la mano

# ttp_sdk_three_ds_popup
source: 3DS is a technology that guarantees the security of your payment. You may have to enter a code that you will receive from your bank via SMS or approve the transaction directly on your bank's mobile app
es: 3DS es una tecnología que garantiza la seguridad de su pago. Es posible que tenga que introducir un código que recibira por parte de su Banco via SMS o aprobar la transacción directamente en la app móvil de su banco

# ttp_sdk_error_no_data
source: There is no connection to the server
es: no hay conexión con el servidor

# ttp_sdk_error_creating_crypto
source: Error when creating a cryptographic package
es: Error al crear el paquete criptográfico

# ttp_sdk_error_information
source: Information
es: Información

# ttp_sdk_error_check_internet
source: Check your Internet connection
es: Compruebe su conexión a Internet

# ttp_sdk_error_outdated
source: The data could be outdated
es: los Datos podrían estar desactualizados

# ttpsdk_currency_template
source: %.2f₽
es: MXN
